In [17]:
import pandas as pd
td = pd.read_csv('c://fontes_dados//bcdata.sgs.25524.csv',sep=';')

In [3]:
td

         data    valor
0  01/01/2012  1087,59
1  01/01/2013  1172,80
2  01/01/2014  1141,12
3  01/01/2015  1141,94
4  01/01/2016  1067,72
5  01/01/2017   942,14
6  01/01/2018   919,20
7  01/01/2019   971,26

In [4]:
td.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   data    8 non-null      object
 1   valor   8 non-null      object
dtypes: object(2)
memory usage: 256.0+ bytes

In [18]:
td['ano'] = pd.to_datetime(td['data']).dt.year
del td['data']
td

     valor   ano
0  1087,59  2012
1  1172,80  2013
2  1141,12  2014
3  1141,94  2015
4  1067,72  2016
5   942,14  2017
6   919,20  2018
7   971,26  2019

In [21]:
td['valor'] = td['valor'].str.replace(',','.').astype(float)

In [22]:
td

     valor   ano
0  1087.59  2012
1  1172.80  2013
2  1141.12  2014
3  1141.94  2015
4  1067.72  2016
5   942.14  2017
6   919.20  2018
7   971.26  2019

In [23]:
td['valor'] = td['valor'] * 1000000

In [26]:
print(td)

          valor   ano
0  1.087590e+09  2012
1  1.172800e+09  2013
2  1.141120e+09  2014
3  1.141940e+09  2015
4  1.067720e+09  2016
5  9.421400e+08  2017
6  9.192000e+08  2018
7  9.712600e+08  2019

In [28]:
td.to_csv('c://fontes_dados/bases_tratadas/saldo_operacoes_td.csv',sep=',',index=False)